import { useParams } from 'react-router-dom';

import { Notification } from 'src/components/Notification';
import { Card } from 'src/pages/UserProfilePage/children/Card';

import styles from './styles.module.scss';

// TODO: Fetch notifications from backend
const notifications = [
  {
    id: '1',
    title: 'Нова нотифікація',
    description: `Детальний опис нотифікації Детальний опис нотифікації Детальний опис нотифікації, детальний опис нотифікації, детальний опис нотифікації, детальний опис нотифікації, детальний опис нотифікації, детальний опис нотифікації, детальний опис нотифікації, детальний опис нотифікації, детальний опис нотифікації, детальний опис нотифікації, детальний опис нотифікації, детальний опис нотифікації, детальний опис нотифікації, детальний опис нотифікації, детальний опис нотифікації, детальний опис нотифікації, детальний опис нотифікації, детальний опис нотифікації, детальний опис нотифікації, детальний опис нотифікації, детальний опис нотифікації, детальний опис нотифікації, детальний опис нотифікації, детальний опис нотифікації, детальний опис нотифікації, детальний опис нотифікації, детальний опис нотифікації, детальний опис нотифікації, детальний опис нотифікації, детальний опис нотифікації, детальний опис нотифікації, детальний опис нотифікації, детальний опис нотифікації, детальний опис нотифікації, детальний опис нотифікації, детальний опис нотифікації, детальний опис нотифікації, детальний опис нотифікації, детальний опис нотифікації, детальний опис нотифікації, детальний опис нотифікації, дета`,
    time: '00:00',
    date: '12.07.2025',
    seen: false,
  },
  {
    id: '2',
    title: 'Нова нотифікація',
    description: 'Детальний опис нотифікації',
    time: '00:00',
    date: '12.07.2025',
    seen: false,
  },
  {
    id: '3',
    title: 'Нова нотифікація',
    description: 'Детальний опис нотифікації',
    time: '00:00',
    date: '12.07.2025',
    seen: true,
  },
  {
    id: '4',
    title: 'Нова нотифікація',
    description: 'Детальний опис нотифікації',
    time: '00:00',
    date: '12.07.2025',
    seen: true,
  },
  {
    id: '5',
    title: 'Нова нотифікація',
    description: 'Детальний опис нотифікації',
    time: '00:00',
    date: '12.07.2025',
    seen: true,
  },
];

export const NotificationTab = () => {
  const { id } = useParams();

  return (
    <Card>
      <div className={styles.notificationsWrapper}>
        {notifications.map((notification) => (
          <Notification
            key={notification.id}
            {...notification}
            isOpen={id === notification.id}
          />
        ))}
      </div>
    </Card>
  );
};
